Autodesk.Revit.DB.Wall.IsValidTargetAttachment(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Says whether the element id can be used as a target for a new attachment.
Remarks:
Valid targets are roofs, floors, ceilings, toposolids, or other walls.
doc:
Current Revit document.
targetId:
A proposed target element id for a wall attachment.
Returns:
Returns true if the element id can be used as a target for a new attachment, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Wall.RemoveAttachment(Autodesk.Revit.DB.ElementId)
Removes any attachment of the wall to the specified target.
targetId:
Target element id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Wall.RemoveAttachment(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.AttachmentLocation)
Removes an attachment at the top or base of a wall, if there is one.
targetId:
Target element id.
attachmentLocation:
The attachment location.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.Wall.AddAttachment(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.AttachmentLocation)
Attaches the wall to the target. If an attachment already
exists with the same "attachmentLocation" value, an exception is thrown.
The target should be a roof, floor, ceiling, toposolid, or other wall.
targetId:
Target element id.
attachmentLocation:
The attachment location.
Throws Autodesk.Revit.Exceptions.ArgumentException:
-or-
wall already has an attachment to targetId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.Wall.GetAttachmentIds(Autodesk.Revit.DB.AttachmentLocation)
Gets the ids of the target elements that are attached to the Wall.
attachmentLocation:
The attachment location.
Returns:
Returns the elements ids that are attached to this wall at the specified "attachmentLocation".
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.Wall.CanSetHostWall(Autodesk.Revit.DB.ElementId)
Checks whether this wall can be associated with the specified host wall.
hostWallId:
The element ID of the host wall to check association against.
Returns:
True if the wall can be associated with the specified host wall.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.Wall.GetHostWallId
Gets the element ID of the host wall that this wall is associated with.
Returns:
The element ID of the host wall that this wall is associated with, or invalidElementId if the wall is not associated with any host wall.
Since:
2027

Autodesk.Revit.DB.Wall.SetHostWallId(Autodesk.Revit.DB.ElementId)
Associates this wall with the specified host wall.  If the host wall is set, this wall will follow the host wall to move or change slanted angle.
The Hosted parameter will be shown in schedule and view filter.
Remarks:
If the wall is already associated with another host wall, it will first be disassociated from the current host wall before being associated with the new host wall.
After associating a wall with a host wall, the "Offset from Host" parameter can be accessed and modified using BuiltInParameter.WALL_OFFSET_FROM_HOST to control the wall's position relative to its host. The "Offset from Host" parameter is initialized to 0 when the wall is associated with a host.
hostWallId:
The element ID of the host wall to associate with.
To disassociate the wall from its current host wall, use invalidElementId.
If the wall is already associated with the specified host wall, this function does nothing.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Either wall is not qualified for the association. E.g. The wall is a stacked wall.
The association would create a circular dependency between walls.
The wall spans do not overlap.
The walls are misaligned and cannot be associated.
A pinned wall cannot participate in the association operation.
Since:
2027